const dialogue = [
    "𝇧‎𝇧‎⚄‎♲‎☲‎✯‎✯‎☺‎⛩‎☲‎⛟‎☲‎☲‎⛇‎◔‎☢‎☲‎❦‎⚭‎⚯‎◔‎◔‎☲‎☲‎☺‎☢‎☺‎⛏‎⚇‎☢‎⚭‎♫‎ܓ‎☲‎✯‎⛛‎☲‎☢‎✯‎⚆‎⛛‎☲‎☲‎⚭‎𝇧‎◔‎♾‎☺‎⚭‎☢‎⚭‎⚭‎⚭‎⛛‎♾‎⛟‎⛟‎⚄‎⛛‎◔‎⚭‎✯‎⚭‎☲‎⚇‎⚄‎⛬‎⛟‎☲‎☲‎⛩‎⛩‎⛛‎☲‎☺‎⛩‎⚭‎⛩‎⚄‎☺‎⚄‎𝇧‎♲‎⛇‎⚆‎☺‎⛩‎☲‎⚭‎⛩‎⛩‎⚭‎⚆‎☢‎◔‎☲‎◔‎⚭‎⚭‎⚭‎⚄‎⛩‎☲‎⚄‎'‎☺‎⛢‎☲‎⛟‎☲‎☲‎",
    "⛩‎⛬‎𝍖‎☺‎☲‎✯‎⛛‎⛬‎⛩‎◔‎☲‎⚯‎𝇧‎◔‎♲‎☲‎⚄‎✯‎⚆‎◔‎⛩‎☺‎☲‎⛛‎⛬‎◔‎♜‎⛟‎☺‎☲‎𝇧‎☲‎☺‎⚄‎☲‎⛩‎☲‎𝇧‎⛟‎⛩‎☲‎❦‎☲‎☲‎☲‎⚯‎☢‎☲‎❦‎✯‎☢‎☲‎⚯‎☺‎☲‎⛬‎♲‎☲‎♾‎⚄‎☲‎⛩‎☲‎☲‎⛇‎⛛‎♫‎⚭‎⚄‎⛛‎⛛‎⚄‎⛛‎☲‎⛩‎⚭‎◔‎♫‎⚄‎⛩‎✯‎♾‎⛛‎⛏‎◔‎⚭‎☢‎⛬‎◔‎⛩‎☲‎⚭‎⛬‎☲‎⚄‎⚆‎☺‎☺‎⚭‎☲‎⚯‎☺‎☺‎⚇‎❦‎⚭‎◔‎⚭‎⚭‎⚯‎◔‎✯‎⚄‎◔‎◔‎⛩‎☺‎⛟‎⚄‎☲‎♫‎⛛‎♾‎☢‎⛩‎⛩‎⛩‎♫‎✯‎⛏‎⛛‎⛛‎♲‎✯‎⛩‎✯‎⛩‎⚭‎☲‎⚯‎♾‎☲‎✯‎𝇧‎♜‎☲‎⚭‎⛟‎⛛‎⚄‎☲‎⚯‎⛩‎☲‎⛩‎𝇧‎⛩‎◔‎⛬‎◔‎⛩‎⚭‎☺‎☲‎⚯‎⚭‎⚭‎",
    "𝅙‎✯‎⚭‎♫‎☲‎♫‎♾‎☲‎☲‎𝇧‎◔‎⚭‎☲‎⚭‎♾‎☲‎⚯‎⚭‎☲‎♫‎✯‎◔‎☲‎☲‎⛬‎❦‎◔‎☲‎⛇‎⛇‎☲‎☺‎◔‎☣‎⛇‎⚭‎◔‎♾‎✯‎⚄‎⚭‎⚄‎⛟‎⛟‎𝇧‎⛩‎⛟‎☲‎𝇧‎⛬‎☲‎⛩‎✯‎⛩‎☺‎⛛‎⛩‎◔‎⛟‎☲‎☲‎☢‎♫‎⛩‎⚄‎⛩‎⛛‎☺‎☺‎☺‎⚄‎☲‎⛩‎☺‎☢‎⛛‎☲‎⛟‎⚯‎⛟‎⛛‎⚄‎☲‎◔‎⚄‎☲‎✯‎⚭‎❦‎⛛‎☲‎⚇‎☺‎⚇‎⛩‎⚭‎✯‎✯‎⛩‎⛩‎⚭‎⚭‎☺‎✯‎⛟‎⚄‎⚭‎☲‎𝇧‎☣‎♜‎⛩‎⚭‎☲‎❦‎❦‎☲‎☲‎☢‎☲‎❦‎⛩‎◔‎✯‎⛏‎⚭‎◔‎⛬‎✯‎⛬‎☲‎⚭‎⛛‎✯‎☲‎☲‎⛬‎☺‎☲‎☢‎☺‎☲‎☲‎♾‎⛟‎⛇‎𝇧‎⛬‎⚭‎☢‎⛏‎⚭‎⛩‎⚄‎𝇧‎◔‎✯‎⛛‎"
];

const audioFiles = [
    "assets/soundfx/alien1.m4a",
    "assets/soundfx/alien2.m4a",
    "assets/soundfx/alien3.m4a",
    "assets/soundfx/alien3.m4a"
]

let currentIndex = -1;

function playDialogue(){
    const textBox = document.querySelector(".alientext")
    const soundPlayer = document.getElementById("sound")

    if (currentIndex < dialogue.length - 1){
        currentIndex++;
        soundPlayer.setAttribute("src",get_random_sound())
        soundPlayer.play();
    } else {
        textBox.style.opacity = 0.0;
        currentIndex = -1;
        return;
    }

    textBox.style.opacity = 1.0;
    textBox.innerText = dialogue[currentIndex];
}

function get_random_sound(){
    return audioFiles[Math.floor(Math.random() * (audioFiles.length-1))]
}